# 문자열 = 'hello world, my name is python'
# for i in 문자열:
#     print(i, end=' ')         # ' h e l l o w o r l d , m y n a m e i s p y t h o n '

#-----------------------------------------------------------------------------------------

# 문자열에서 알파벳 o의 갯수를 구하시오

# o_count = 0                                              # '_' 띄어쓰기로 사용
# 문자열 = 'hello world, my name is python'
# for i in 문자열:
#     if(i == 'o'):                                             
#         o_count += 1                                     # O_count 에 누적연산
# print(o_count)  
#   
#-----------------------------------------------------------------------------------------

# 1월 ~ 12월을 출력하되 입력받은 월은 skip

# skip = int(input('입력하시오 ==> '))
# for i in range(1, 13):
#     if i == skip:
#         continue
#     print(i, '월')
# print()

#-----------------------------------------------------------------------------------------

# 1월 ~ 12월을 출력하되 입력받은 월부터 출력하지 않음

# p = int(input('입력하시오 ==> '))
# for j in range(1, 13):
#     if j == p:
#         break
#     print(j, '월')
# print()

#-----------------------------------------------------------------------------------------

# subway1 = 10
# subway2 = 12
# subway3 = 15
# 리스트 = [10 ,12 ,15]
# for i in 리스트:
#     print(i, '명')

#-----------------------------------------------------------------------------------------

# 구구단을 만들어주세요

for i in range(1, 10):
    for j in range(1, 10):
        print(j, 'x', i , '=', i*j, end ='\t')                # '\t' tab 키를 눌러줘
    print()

