# 함수
# 변수 : 데이터 값을 저장하기 위한 공간 (값 재사용/ 수정 목적)
# 함수 : 코드를 저장하기 위한 공간 (코드 재활용 목적)
# 함수의 특징 : ()가 있다, def를 통해서 만들 수 있다.

이름 = '홍길동'                                         # 변수는 데이터만 저장가능
def 홍길동():                                           # 함수는 코드를 저장(print 같은 것 사용가능)
    print('안녕하세요 저는 홍길동 입니다.')
    print('제가 사는 곳은 인천이고요.')
    print('00대학교에 다니고 있습니다.')

def 임꺽정():
    print('안녕하세요 저는 임꺽정 입니다.') 
    print('제가 사는 곳은 서울이고요.')
    print('AA대학교에 다니고 있습니다.')

def 유관순():
    print('안녕하세요 저는 유관순 입니다.')
    print('제가 사는 곳은 부천이고요.')
    print('BB대학교에 다니고 있습니다.')
이름
홍길동()
임꺽정()
유관순()