# 처음 만들는 것보다 수정(유지보수)하는것이 더 중요해짐
# 프로그래밍 언어늬 발전은 '유지보수'에 초점이 맞춰져있음
print('안녕 파이썬!') 
print('오늘은 파이썬 공부 첫 날 입니다.')
print('hello 파이썬')
print('파이썬은 현재 빅데이터, 인공지능, 머신비전, 웹개발 등에 사용됩니다.')
print(123) # 숫자는 그냥적는다(''필요 x)
print('123') # 글자는 ''필요
print(123+321)

# 변수(프로그래밍) : 데이터를 저장하는 공간
공간1 = '파이썬'
공간2 = 321

print(공간1)
print(공간2)

공간3 = ('hello 파이썬')
공간2 = 111
print(공간3)
print(공간2)

# '=' 같다x ->오른쪽에 있는 값을 왼쪽 공간에 담는다.
공간4 = 'python'
# 공간4 라는 저장공간에 python을 담는다.
# 변수 활용 

print('안녕',공간4,'!') 
print('오늘은',공간4,' 공부 첫 날 입니다.')
print('hello',공간4)
